Repository: ZacharyJiao/GlideTranslate
Catalog: App/GlideTranslate/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# privacyHistory.delete.presetCategory.custom
source: Custom preset
zh_hans: 自定义提示词

# privacyHistory.diagnostics
source: Diagnostics
zh_hans: 诊断

# privacyHistory.diagnostics.preview.title
source: Review sanitized diagnostics
zh_hans: 查看脱敏诊断信息

# privacyHistory.diagnostics.previewFirst
source: A sanitized preview appears before you choose where to save.
zh_hans: 选择保存位置前会先显示脱敏预览。

# privacyHistory.diagnostics.start
source: Export diagnostics…
zh_hans: 导出诊断…

# privacyHistory.diagnostics.start.hint
source: Previews a sanitized report before opening the save panel.
zh_hans: 打开保存面板前先预览脱敏报告。

# privacyHistory.disabled.existingRecordsRemain
source: Disabling history stops future writes; existing records remain until removed.
zh_hans: 停用历史仅停止后续写入；现有记录会保留至手动移除。

# privacyHistory.enabled
source: Translation history
zh_hans: 翻译历史

# privacyHistory.enabled.futureWritesAndRetention
source: Only future completed translations are written and governed by retention.
zh_hans: 仅后续完成的翻译会写入，并受保留策略管理。

# privacyHistory.exclusions
source: History exclusions
zh_hans: 历史排除项

# privacyHistory.exclusions.preferencesOnly
source: Application exclusions are stored only in preferences.
zh_hans: 应用排除项仅保存在偏好设置中。

# privacyHistory.maximumCount
source: Maximum records
zh_hans: 记录上限

# privacyHistory.maximumCount.accessibility
source: Maximum history record count
zh_hans: 历史记录数量上限

# privacyHistory.reset
source: Reset Private Data…
zh_hans: 重置私密数据…

# privacyHistory.reset.completed
source: Reset completed
zh_hans: 重置完成

# privacyHistory.reset.confirm
source: Reset private data
zh_hans: 重置私密数据

# privacyHistory.reset.confirm.categoriesAndKeychainCaveat
source: This resets preferences, providers, custom prompts, history, and local caches. Keychain items are removed only by their owning reset stages.
zh_hans: 这会重置偏好设置、提供商、自定义提示词、历史与本地缓存。钥匙串项目仅由各自所属的重置阶段移除。

# privacyHistory.reset.confirm.hint
source: Runs the one-shot private-data reset after confirmation.
zh_hans: 确认后执行一次私密数据重置。

# privacyHistory.reset.confirm.title
source: Reset private data?
zh_hans: 重置私密数据？

# privacyHistory.reset.hint
source: Opens a confirmation listing affected private-data categories.
zh_hans: 打开确认框并列出受影响的私密数据类别。

# privacyHistory.reset.report
source: Reset report
zh_hans: 重置报告

# privacyHistory.reset.stage.cancelRequests
source: Cancel active requests
zh_hans: 取消活动请求

# privacyHistory.reset.stage.clearCaches
source: Clear transient caches
zh_hans: 清除临时缓存

# privacyHistory.reset.stage.closeStores
source: Close private stores
zh_hans: 关闭私密存储

# privacyHistory.reset.stage.deleteHistoryStoreAndKey
source: Delete history store and key
zh_hans: 删除历史存储与密钥

# privacyHistory.reset.stage.deletePrivatePresetStoreAndKey
source: Delete custom-prompt store and key
zh_hans: 删除自定义提示词存储与密钥

# privacyHistory.reset.stage.deleteProviderVault
source: Delete provider vault
zh_hans: 删除提供商保险库

# privacyHistory.reset.stage.pauseCapture
source: Pause capture
zh_hans: 暂停捕获

# privacyHistory.reset.stage.resetPreferences
source: Reset preferences
zh_hans: 重置偏好设置

# privacyHistory.reset.stage.unregisterLaunchAtLogin
source: Disable launch at login
zh_hans: 停用登录时启动

# privacyHistory.reset.stage.unregisterShortcut
source: Unregister shortcut
zh_hans: 注销快捷键

# privacyHistory.retention
source: Retention days
zh_hans: 保留天数

# privacyHistory.search.explanation
source: Search encrypted history, then inspect and delete records in this temporary view.
zh_hans: 搜索加密历史记录，并在此临时视图中查看或删除。

# privacyHistory.selection.empty
source: Select a history record
zh_hans: 选择一条历史记录

# privacyHistory.search
source: Open History
zh_hans: 打开历史

# privacyHistory.search.query
source: Search history
zh_hans: 搜索历史

# privacyHistory.search.run
source: Search
zh_hans: 搜索

# privacyHistory.unrecoverable.deleteAndRestart
source: Delete damaged history and restart
zh_hans: 删除损坏历史并重新启动

# privacyHistory.unrecoverable.deleteAndRestart.hint
source: Deletes the unrecoverable encrypted history store; restart is required.
zh_hans: 删除无法恢复的加密历史存储；随后需要重新启动。

# privacyHistory.unrecoverable.description
source: Encrypted history cannot be opened safely.
zh_hans: 无法安全打开加密历史。

# privacyHistory.unrecoverable.restartRequired
source: History was removed. Restart Glide Translate.
zh_hans: 历史已移除，请重新启动轻译。

# privacyHistory.unrecoverable.title
source: History Unavailable
zh_hans: 历史不可用

# prompts.action.explainSentence
source: Explain sentence
zh_hans: 解释句子

# prompts.action.explainWord
source: Explain word
zh_hans: 解释单词

# prompts.action.polish
source: Polish
zh_hans: 润色

# prompts.action.translate
source: Translate
zh_hans: 翻译

# prompts.builtIns
source: Built-in prompts
zh_hans: 内置提示词

# prompts.custom
source: Custom prompts
zh_hans: 自定义提示词

# prompts.default
source: Default prompt
zh_hans: 默认提示词

# prompts.default.choose
source: Choose a replacement
zh_hans: 选择替代项

# prompts.delete
source: Delete
zh_hans: 删除

# prompts.delete.hint
source: Deletes this custom prompt after any required replacement is selected.
zh_hans: 选择必要的替代项后删除此自定义提示词。

# prompts.deleteDefault.confirm
source: Replace default and delete
zh_hans: 替换默认项并删除

# prompts.deleteDefault.confirm.hint
source: Sets the selected replacement before deleting the current default.
zh_hans: 删除当前默认提示词前先设置所选替代项。

# prompts.deleteDefault.replacement
source: Choose a new default before deleting
zh_hans: 删除前选择新的默认提示词

# prompts.duplicate
source: Duplicate
zh_hans: 复制

# prompts.edit
source: Edit
zh_hans: 编辑

# prompts.editor.explanationText
source: Edit a custom preset. Validation remains local until you explicitly save.
zh_hans: 编辑自定义提示词；仅在明确保存后写入，验证过程保持本地。

# prompts.editor.title
source: Prompt Editor
zh_hans: 提示词编辑器

# prompts.editor.action
source: Action
zh_hans: 操作

# prompts.editor.explanation
source: Explanation
zh_hans: 说明

# prompts.editor.name
source: Name
zh_hans: 名称

# prompts.editor.target
source: Target language
zh_hans: 目标语言

# prompts.editor.template
source: Prompt format
zh_hans: 提示词格式

# prompts.editor.template.guidance
source: Write the instruction sent to the model. Include {text} exactly once where the text to translate belongs.
zh_hans: 填写发送给模型的指令，并在待翻译内容所在位置准确使用一次 {text}。

# prompts.editor.placeholder.required
source: Required text placeholder
zh_hans: 必需的文本占位符

# prompts.editor.placeholder.optional
source: Optional language placeholders
zh_hans: 可选的语言占位符

# prompts.new
source: New Prompt
zh_hans: 新建提示词

# prompts.request.title
source: Complete Model Input
zh_hans: 完整模型输入

# prompts.request.explanation
source: These are the two messages sent to the model. {text} is replaced by the text you translate.
zh_hans: 以下是发送给模型的两条消息；{text} 会替换为实际待翻译内容。

# prompts.request.systemMessage
source: System message
zh_hans: 系统消息

# prompts.request.userMessage
source: User message
zh_hans: 用户消息

# prompts.selection.empty
source: Select a prompt
zh_hans: 选择一个提示词

# prompts.setDefault
source: Set Default
zh_hans: 设为默认

# prompts.validation.emptyName
source: Enter a name.
zh_hans: 请输入名称。

# prompts.validation.explanationTooLong
source: The explanation is too long.
zh_hans: 说明过长。

# prompts.validation.immutableBuiltIn
source: Built-in prompts cannot be changed.
zh_hans: 内置提示词不可更改。

# prompts.validation.invalidCustomIdentifier
source: The custom prompt identifier is invalid.
zh_hans: 自定义提示词标识无效。

# prompts.validation.invalidTemplate
source: The template is invalid.
zh_hans: 模板无效。

# prompts.validation.nameTooLong
source: The name is too long.
zh_hans: 名称过长。

# prompts.validation.presetNotFound
source: The prompt could not be found.
zh_hans: 找不到提示词。

# prompts.validation.templateTooLong
source: The template is too long.
zh_hans: 模板过长。

# result.backToLatest
source: Back to Latest
zh_hans: 回到最新内容

# result.changePreset
source: Change Preset
zh_hans: 更改提示词

# result.close
source: Close
zh_hans: 关闭

# result.copy
source: Copy
zh_hans: 复制

# result.motion.reduced
source: Reduced motion
zh_hans: 减少动态效果

# result.motion.standard
source: Standard motion
zh_hans: 标准动态效果

# result.output.heading
source: Translation result
zh_hans: 翻译结果

# result.phase.completed
source: Completed
zh_hans: 已完成

# result.phase.connecting
source: Connecting
zh_hans: 正在连接

# result.phase.failed
source: Unavailable
zh_hans: 不可用

# result.phase.preparing
source: Preparing
zh_hans: 正在准备

# result.phase.streaming
source: Translating
zh_hans: 正在翻译

# result.phase.waiting
source: Waiting for response
zh_hans: 正在等待响应

# result.pin
source: Pin
zh_hans: 固定

# result.pinnedReplaced.announcement
source: Pinned result replaced
zh_hans: 已替换固定结果

# result.retry
source: Retry
zh_hans: 重试

# result.source.accessibility
source: Source text
zh_hans: 源文本

# result.source.collapse
source: Collapse source text
zh_hans: 收起源文本

# result.source.expand
source: Expand source text
zh_hans: 展开源文本

# selection.accessibility
source: Accessibility permission
zh_hans: 辅助功能权限

# selection.accessibility.enable
source: Request access
zh_hans: 请求权限

# selection.accessibility.enable.hint
source: Asks macOS for Accessibility access used by explicit selection capture.
zh_hans: 向 macOS 请求用于明确选区捕获的辅助功能权限。

# selection.accessibility.openSettings
source: Open System Settings
zh_hans: 打开系统设置

# selection.accessibility.openSettings.hint
source: Opens the macOS Accessibility privacy pane.
zh_hans: 打开 macOS 辅助功能隐私面板。

# selection.accessibility.refresh
source: Refresh status
zh_hans: 刷新状态

# selection.accessibility.status.denied
source: Not granted
zh_hans: 未授予

# selection.accessibility.status.granted
source: Granted
zh_hans: 已授予

# selection.accessibility.status.unknown
source: Not checked
zh_hans: 未检查

# selection.applications
source: Application allowlist
zh_hans: 应用允许列表

# selection.applications.add
source: Add application
zh_hans: 添加应用

# selection.applications.none
source: No applications configured.
zh_hans: 尚未配置应用。

# selection.applications.remove
source: Remove
zh_hans: 移除

# selection.applications.remove.hint
source: Removes this application from automatic capture preferences.
zh_hans: 从自动捕获偏好中移除此应用。

# selection.applications.vscode.accessibilityNote
source: VS Code's main editor exposes selected text only when Editor: Accessibility Support is On. Sidebar text does not require this setting.
zh_hans: VS Code 主编辑区仅在“编辑器: 辅助功能支持”设为“开启”时提供选中文本；侧边栏不受此设置影响。

# selection.applications.vscode.openSettings
source: Open this setting in VS Code
zh_hans: 在 VS Code 中打开此设置

# selection.clipboardFallback
source: Clipboard fallback
zh_hans: 剪贴板回退

# selection.clipboardFallback.disclosure
source: Clipboard fallback reads the clipboard only after an explicit translation action.
zh_hans: 剪贴板回退仅在明确发起翻译后读取剪贴板。

# selection.clipboardFallback.enable
source: Allow clipboard fallback
zh_hans: 允许剪贴板回退

# selection.clipboardFallback.enable.hint
source: Allows an explicit translation action to read clipboard text when selection capture fails.
zh_hans: 选区捕获失败时，允许明确的翻译操作读取剪贴板文本。

# selection.debounce
source: Selection delay (milliseconds)
zh_hans: 选区延迟（毫秒）

# selection.keyboard
source: Keyboard selection capture
zh_hans: 键盘选区捕获

# selection.limit
source: Selection character limit
zh_hans: 选区字符上限

# selection.mouse
source: Mouse selection capture
zh_hans: 鼠标选区捕获

# settings.about.explanation
source: Version, privacy commitments, licenses, and project links.
zh_hans: 版本、隐私承诺、许可证与项目链接。

# settings.about
source: About
zh_hans: 关于

# settings.general.explanation
source: Choose app language, translation defaults, shortcut, and capture behavior.
zh_hans: 选择应用语言、翻译默认项、快捷键和捕获行为。

# settings.general
source: General
zh_hans: 通用

# settings.models.explanation
source: Add API services, load their available models, and choose which model to use.
zh_hans: 添加 API 服务，获取可用模型列表，并选择要使用的模型。

# settings.models
source: Models
zh_hans: 模型

# settings.privacyHistory.explanation
source: Control encrypted history, exclusions, diagnostics, and destructive reset.
zh_hans: 管理加密历史、排除规则、诊断与破坏性重置。

# settings.privacyHistory
source: Privacy & History
zh_hans: 隐私与历史

# settings.prompts.explanation
source: Select a prompt to inspect every message sent to the model, or create a custom prompt.
zh_hans: 选择提示词可查看发送给模型的全部消息，也可新建自定义提示词。

# settings.prompts
source: Prompts
zh_hans: 提示词

# settings.selection.explanation
source: Manage Accessibility status, allowed applications, triggers, and clipboard fallback.
zh_hans: 管理辅助功能状态、允许的应用、触发方式和剪贴板回退。

# settings.selection
source: Selection
zh_hans: 选区

# shortcut.conflict.nextAction
source: This shortcut conflicts with another app. Record a replacement.
zh_hans: 此快捷键与其他应用冲突，请录制替代快捷键。

# shortcut.unavailable.nextAction
source: The global shortcut is unavailable. Try another shortcut or use the menu.
zh_hans: 全局快捷键不可用，请尝试其他快捷键或使用菜单。

# provider.readiness.ready
source: Ready
zh_hans: 已就绪

# provider.readiness.missingModel
source: Model required
zh_hans: 需要模型

# provider.readiness.destinationConfirmationRequired
source: Reconnect required
zh_hans: 需要重新连接

# provider.readiness.credentialRejected
source: Credential rejected
zh_hans: 凭据已被拒绝

# provider.readiness.providerFailure
source: Provider error
zh_hans: 提供商错误

# models.credential.new
source: New credential
zh_hans: 新凭据

# models.credential.new.explanation
source: Enter a credential to store for this new provider. No existing credential is changed.
zh_hans: 为此新提供商输入要保存的凭据；不会更改现有凭据。

# models.credential.present
source: Credential stored
zh_hans: 已存储凭据

# models.credential.missing
source: No credential stored
zh_hans: 未存储凭据

# models.provider.readiness
source: Readiness
zh_hans: 就绪状态

# manual.provider.defaultRoute
source: Starts with the General default; choose another provider for this request only.
zh_hans: 从“通用”中的默认提供商开始；选择其他提供商仅用于本次请求。

# manual.provider.override
source: One-request override
zh_hans: 仅本次请求覆盖

# manual.provider.model
source: Model
zh_hans: 模型

# general.defaultProvider.details
source: Automatic selection and new manual translations use this provider.
zh_hans: 自动选择和新的手动翻译会使用此提供商。

# general.defaultProvider.none.explanation
source: Choose a provider before using automatic or manual translation.
zh_hans: 使用自动或手动翻译前，请先选择提供商。

# menu.provider.automatic
source: Automatic selection uses the General default provider.
zh_hans: 自动选择使用“通用”中的默认提供商。

# menu.provider.model
source: Model
zh_hans: 模型

# menu.provider.credential
source: Credential
zh_hans: 凭据

# models.default
source: Default
zh_hans: 默认

# models.setAsDefault
source: Set as default
zh_hans: 设为默认

# general.defaultProvider.destination
source: Where text is sent
zh_hans: 文本发送范围

# manual.provider.override.explanation
source: This provider is used for this request only; the General default remains unchanged.
zh_hans: 此提供商仅用于本次请求；“通用”中的默认设置不会更改。
